In [1]:
# !wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-10.csv.gz
# !wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv

# !gunzip green_tripdata_2019-10.csv.gz

In [2]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

## Run postgres using Docker

```bash
docker run -it \
  -e POSTGRES_USER="root" \
  -e POSTGRES_PASSWORD="root" \
  -e POSTGRES_DB="ny_taxi" \
  -v $(pwd)/ny_taxi_postgres_data:/var/lib/postgresql/data \
  -p 5433:5432 \
  postgres:16
```

## Connect to Postgres

In [7]:
from sqlalchemy import create_engine

In [8]:
engine = create_engine('postgresql://root:root@localhost:5433/ny_taxi')

In [9]:
engine.connect()

## Prepare Postgres

In [12]:
df = pd.read_csv('green_tripdata_2019-10.csv')
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1.0,112,196,1.0,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2.0,1.0,0.0
1,1.0,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1.0,43,263,1.0,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2.0,1.0,0.0
2,1.0,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1.0,255,228,2.0,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2.0,1.0,0.0
3,1.0,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1.0,181,181,1.0,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2.0,1.0,0.0
4,2.0,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1.0,97,188,1.0,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1.0,1.0,0.0

In [13]:
df.shape

(476386, 20)

In [14]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [15]:
print(pd.io.sql.get_schema(df, name='yellow_taxi_data', con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" FLOAT(53),
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" FLOAT(53),
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type FLOAT(53),
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [16]:
df_iter = pd.read_csv('green_tripdata_2019-10.csv', iterator=True, chunksize=100000)

In [17]:
df = next(df_iter)

In [18]:
len(df)

100000

In [19]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [20]:
df

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2,1.0,0.00
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2,1.0,0.00
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2,1.0,0.00
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2,1.0,0.00
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1,1.0,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,2,2019-10-08 15:45:56,2019-10-08 15:54:45,N,1,95,95,1,0.85,7.0,0.00,0.5,0.00,0.0,NaN,0.3,7.80,2,1.0,0.00
99996,2,2019-10-08 15:43:31,2019-10-08 15:50:11,N,1,74,41,1,0.53,6.0,0.00,0.5,0.00,0.0,NaN,0.3,6.80,2,1.0,0.00
99997,2,2019-10-08 15:57:26,2019-10-08 16:17:41,N,1,75,141,1,1.94,13.0,0.00,0.5,2.98,0.0,NaN,0.3,19.53,1,1.0,2.75
99998,2,2019-10-08 14:58:24,2019-10-08 15:03:40,N,1,33,33,1,0.89,6.0,0.00,0.5,1.36,0.0,NaN,0.3,8.16,1,1.0,0.00
99999,2,2019-10-08 15:10:20,2019-10-08 15:17:44,N,1,33,40,1,1.24,7.0,0.00,0.5,0.00,0.0,NaN,0.3,7.80,2,1.0,0.00

In [21]:
df.head(n=0).to_sql(name='green_taxi_data', con=engine, if_exists='replace')

0

In [22]:
%time df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

CPU times: user 3.01 s, sys: 92.8 ms, total: 3.1 s
Wall time: 5.23 s

1000

In [23]:
from time import time

while True: 
    t_start = time()

    try:
        df = next(df_iter)
    except StopIteration:
        print("Finished ingesting data into the db")
        break

    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    
    df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

    t_end = time()

    print('inserted another chunk, took %.3f second' % (t_end - t_start))

inserted another chunk, took 5.214 second
inserted another chunk, took 5.297 second
inserted another chunk, took 5.159 second
inserted another chunk, took 3.425 second
Finished ingesting data into the db

In [24]:
df_zones = pd.read_csv('taxi_zone_lookup.csv')
df_zones.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [25]:
%time df_zones.to_sql(name='zones', con=engine, if_exists='replace')

CPU times: user 7.12 ms, sys: 1.74 ms, total: 8.87 ms
Wall time: 36.4 ms

265

In [69]:
# Check the number of rows in the table
query = "SELECT count(*) FROM green_taxi_data;"

pd.read_sql(query, engine)

    count
0  476386

## Question 3. Trip Segmentation Count
During the period of October 1st 2019 (inclusive) and November 1st 2019 (exclusive), how many trips, respectively, happened:

1. Up to 1 mile
2. In between 1 (exclusive) and 3 miles (inclusive),
3. In between 3 (exclusive) and 7 miles (inclusive),
4. In between 7 (exclusive) and 10 miles (inclusive),
5. Over 10 miles

Answers:

* 104,802; 197,670; 110,612; 27,831; 35,281
* 104,802; 198,924; 109,603; 27,678; 35,189
* 104,793; 201,407; 110,612; 27,831; 35,281
* 104,793; 202,661; 109,603; 27,678; 35,189
* 104,838; 199,013; 109,645; 27,688; 35,202

In [70]:
# 1. Up to 1 mile

query_1 = """
SELECT count(*)
FROM green_taxi_data 
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01'
  AND trip_distance <= 1;
"""

pd.read_sql(query_1, engine)

    count
0  104830

In [71]:
# 2. In between 1 (exclusive) and 3 miles (inclusive)
query_2 = """
SELECT count(*) 
FROM green_taxi_data 
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01'
  AND trip_distance > 1 AND trip_distance <= 3;
"""

pd.read_sql(query_2, engine)

    count
0  198995

In [72]:
# 3. In between 3 (exclusive) and 7 miles (inclusive)
query_3 = """
SELECT count(*) 
FROM green_taxi_data 
WHERE lpep_pickup_datetime >= '2019-10-01 00:00:00.00' AND lpep_pickup_datetime < '2019-11-01 00:00:00.00'
  AND trip_distance > 3 AND trip_distance <= 7;
"""

pd.read_sql(query_3, engine)

    count
0  109642

In [73]:
# 4. In between 7 (exclusive) and 10 miles (inclusive)
query_4 = """    
SELECT count(*) 
FROM green_taxi_data 
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01'
  AND trip_distance > 7 AND trip_distance <= 10;
"""

pd.read_sql(query_4, engine)

   count
0  27686

In [74]:
# 5. Over 10 miles
query_5 = """
SELECT count(*) 
FROM green_taxi_data 
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01'
  AND trip_distance > 10;
"""

pd.read_sql(query_5, engine)

   count
0  35201

## Question 4. Longest trip for each day

Which was the pick up day with the longest trip distance? Use the pick up time for your calculations.

Tip: For every day, we only care about one single trip with the longest distance.

* 2019-10-11
* 2019-10-24
* 2019-10-26
* 2019-10-31

In [75]:
query_6 = """
SELECT 
    DATE(lpep_pickup_datetime) AS pickup_date, 
    MAX(trip_distance) AS longest_trip_distance
FROM 
    green_taxi_data 
WHERE 
    lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01'
GROUP BY 
    pickup_date
ORDER BY 
    longest_trip_distance DESC
LIMIT 1;
"""

pd.read_sql(query_6, engine)

  pickup_date  longest_trip_distance
0  2019-10-31                 515.89

## Question 5. Three biggest pickup zones

Which were the top pickup locations with over 13,000 in `total_amount` (across all trips) for 2019-10-18?

Consider only `lpep_pickup_datetime` when filtering by date.

* East Harlem North, East Harlem South, Morningside Heights
* East Harlem North, Morningside Heights
* Morningside Heights, Astoria Park, East Harlem South
* Bedford, East Harlem North, Astoria Park

In [76]:
query_7 = """
SELECT 
    z."Zone", 
    SUM(g.total_amount) AS total_amount_sum
FROM 
    green_taxi_data g
LEFT JOIN 
    zones z ON g."PULocationID" = z."LocationID"
WHERE 
    g.lpep_pickup_datetime >= '2019-10-18' AND g.lpep_pickup_datetime < '2019-10-19'
GROUP BY 
    z."Zone"
HAVING 
    SUM(g.total_amount) > 13000
ORDER BY 
    total_amount_sum DESC;
"""


pd.read_sql(query_7, engine)

                  Zone  total_amount_sum
0    East Harlem North          18686.68
1    East Harlem South          16797.26
2  Morningside Heights          13029.79

## Question 6. Largest tip

For the passengers picked up in October 2019 in the zone named "East Harlem North" which was the drop off zone that had the largest tip?

Note: it's `tip` , not `trip`

We need the name of the zone, not the ID.

* Yorkville West
* JFK Airport
* East Harlem North
* East Harlem South

In [67]:
query_8 = """
SELECT 
    zones_pickup."Zone" AS Zone_PU, 
    zones_dropoff."Zone" AS Zone_DO, 
    MAX(g."tip_amount") AS max_tip
FROM 
    green_taxi_data g
LEFT JOIN 
    zones zones_pickup ON zones_pickup."LocationID" = g."PULocationID"
LEFT JOIN 
    zones zones_dropoff ON zones_dropoff."LocationID" = g."DOLocationID"
WHERE 
    zones_pickup."Zone" = 'East Harlem North'
    AND g."lpep_pickup_datetime" >= '2019-10-01 00:00:00.00'
    AND g."lpep_pickup_datetime" < '2019-11-01 00:00:00.00'
GROUP BY 
    zones_pickup."Zone", zones_dropoff."Zone"
ORDER BY 
    max_tip DESC
LIMIT 1;
"""


pd.read_sql(query_8, engine)

             zone_pu      zone_do  max_tip
0  East Harlem North  JFK Airport     87.3